# SegmentId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentId..::..SegmentId Property
MEPNetworkSegmentId Class See Also
---
The segment identifier.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public int SegmentId { get; set; }
```

Visual Basic
---
```text
Public Property SegmentId As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int SegmentId {
	int get ();
	void set (int value);
}
```

# See Also
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace